Revit 2026 API

# IFCData Class

---

A specialized type of abstract data block that can represent any data type.

SystemObject Autodesk.Revit.DB.IFCIFCData

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCData : IDisposable
```
```vb
Public Class IFCData
	Implements IDisposable
```
```cpp
public ref class IFCData : IDisposable
```
```fsharp
type IFCData =
    class
        interface IDisposable
    end
```

The IFCData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCData | Creates a copy object. |

|  | Name | Description |
| --- | --- | --- |
|  | HasValue | Identifies if the data is empty or contains a value. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PrimitiveType | The primitive data type. |

|  | Name | Description |
| --- | --- | --- |
|  | AsAggregate | Gets storage value as IFCAggregate when its PrimitiveType is aggregate. |
|  | AsBoolean | Gets storage value as boolean when its PrimitiveType is boolean. |
|  | AsDouble | Gets storage value as double when its PrimitiveType is double. |
|  | AsInstance | Gets storage value as IFCAnyHandle when its PrimitiveType is instance. |
|  | AsInteger | Gets storage value as integer when its PrimitiveType is integer. |
|  | AsLogical | Gets storage value as IFCLogical when its PrimitiveType is logical. |
|  | AsString | Gets storage value as string when its PrimitiveType is string, binary or enumeration. |
|  | CreateBinary | Creates a binary data object. |
|  | CreateBoolean | Creates a boolean data object. |
|  | CreateBooleanOfType | Creates a boolean data object of the specified type. |
|  | CreateDouble | Creates a double data object. |
|  | CreateDoubleOfType | Creates a double data object of the specified type. |
|  | CreateEnumeration | Creates a enum data object. |
|  | CreateIFCAggregate | Creates an IFCAggregate data object. |
|  | CreateIFCAnyHandle | Creates an IFCAnyHandle data object. |
|  | CreateInteger | Creates an integer data object. |
|  | CreateIntegerOfType | Creates an integer data object of the specified type. |
|  | CreateLogical | Creates a logical data object. |
|  | CreateLogicalOfType | Creates a logical data object of the specified type. |
|  | CreateString | Creates a string data object. |
|  | CreateStringOfType | Creates a string data object of the specified type. |
|  | Dispose | Releases all resources used by the IFCData |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the hash code. (Overrides ObjectGetHashCode) |
|  | GetSimpleType | Gets the IFC type name. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetTypeList | Gets the multiple strings represent one IFC type name. |
|  | HasSimpleType | Determines if there is one corresponding IFC type. |
|  | SetSimpleType | Sets the corresponding IFC type by its name. |
|  | SetTypeList |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(IFCData, IFCData) | Determines whether two IFCDatas are the same. |
|  | Inequality(IFCData, IFCData) | Determines whether two IFCDatas are different. |

#### Reference

Autodesk.Revit.DB.IFC Namespace